[
    "(at around 54 mins) When Ray and Brenda are in the movie theatre, the preview screen reads: \"The following 'Peeview' has been 'assproved' for immature audiences only. If you can read this you are too close. Pee Pee Poopy Boogers Farts Butthole. Rated I for Immature. We thought it would be funny to put this here. Kiss our asses and take it off pause.\"",

    "The original script featured a cameo role for Jamie Lee Curtis as Cindy would discover her hiding in a closet in her house while the killer was chasing her up the stairs.",

    "(at around 6 mins) In one of the first scenes in Cindy's bedroom. She says, \"Would like to have a little bump-bump?\" This line was originally written for Scream (1996), but it was later changed to \"Would you like to have a little raw footage?\"",

    "(at around 42 mins) The lunch room menu at the high school reads \"Same Old Shit\".",

    "\"Scary Movie\" was the working title of Scream (1996), the main movie parodied.",

    "Jared Leto was offered to play Bobby during the early stages of casting. He eventually declined, in favor of doing Requiem for a Dream (2000), which also starred \"Scary Movie\" writer/actor Marlon Wayans.",

    "When Anna Faris landed a part in the film, she was working in an ad agency and was only a week away from moving to her company's London office.",

    "(at around 46 mins) When Cindy is in Miss Man's office, there is a Nazi SS uniform hanging to the right of Miss Man.",

    "In the theatrical trailer, one scene shows a close up of a character holding up a chip and saying, \"This stuff is good!\". In the R-rated version it's revealed the character is actually holding up a joint.",

    "The role of Brenda was originally offered to Aaliyah but she turned it down.",

    "Released by the same studio (Dimension Films) as the Scream (1996) films.",

    "The character that Shannon Elizabeth plays is called Buffy. The character is an obvious spoof of Helen Shivers from I Know What You Did Last Summer (1997), played by Sarah Michelle Gellar, who famously played Buffy Summers in Buffy the Vampire Slayer (1997) for 7 years and in the show there's a character played by Alyson Hannigan who was in American Pie, a movie Shannon Elizabeth was also in",

    "Despite the screenplay credits for Aaron Seltzer and Jason Friedberg, little if anything from their screenplay was used. Marlon Wayans in particular has said that he and most of the other writers responsible for the final script never even read Seltzer and Friedberg's draft, after Keenen Ivory Wayans checked it over and assured them that it contained nothing worth retaining in their version.",

    "After the release of Scary Movie 2 (2001), the covers for Scary Movie were modified - the \"NO SEQUELS\" is marked over with a large red X.",

    "Alicia Silverstone was offered the lead role of Cindy Campbell, but turned it down.",

    "(at around 2 mins) In the opening scene, a movie poster for Scream (1996) can be seen on the wall near the front door of Drew's house.",

    "The script for this movie is actually a combination of two scripts Dimension Films bought in 1998: \"Last Summer I Screamed Because Halloween Fell On Friday The 13th\" written by the Wayans brothers and Phil Beauman; and \"Scream If You Know What I Did Last Halloween\" by Jason Friedberg and Aaron Seltzer. (The latter two are the \"two of the six writers of Scary Movie\" who went on to make Date Movie (2006), Epic Movie (2007), etc.)",

    "Jenny McCarthy-Wahlberg and Britney Spears were offered the role of Drew Decker. McCarthy turned down the role in order to instead appear in Scream 3 (2000) but would later appear as Katie in Scary Movie 3 (2003).",

    "(at around 38 mins) In the scene outside the Sheriff's dept with Gail Hailstorm reporting, the Steveston County Sheriff's Dept sign shows it was founded in 2017.",

    "The principal (Principal Squiggman) is played by David L. Lander, who played greaser Squiggy on Laverne & Shirley (1976) (there's a bottle of Schotz beer, from the brewery where Laverne and Shirley worked, in his office). The principal in Scream (1996), which this film parodies, was played by Henry Winkler, who played greaser Fonzie on Happy Days (1974).",

    "Most of the brand names seen in the movie have been slightly changed, for example, when the killer is telling jokes to the others there is a character wearing a t-shirt with Toke written in a can printed on it referring to Coke. Also, all of the drinks seen in the fridge have been misspelled, for example Cult instead of Colt. Same with when the killer is doing the 'wazzzzzup' scene he is holding a beer called Killer in reference to Miller.",

    "(at around 40 mins) The \"Whassup\" scene is a parody of a 1999 Budweiser TV commercial titled \"True\". The commercial became an inspiration for other Budweiser commercials using the \"Whassup\" catchphrase up till the year 2002.",

    "Jennifer Coolidge was offered the role of Miss Mann, but she turned it down.",

    "Sarah Michelle Gellar is the only actor/actress to appear in two films parodied in this film: Scream 2 (1997) and I Know What You Did Last Summer (1997).",

    "The cameraman played by Dan Joffre is called Kenny. Not only is this a reference to Scream (1996), where the cameraman (W. Earl Brown) in the movie had the same name, but is also the last name of Francis Kenny, Scary Movie's cinematographer.",

    "The role of Brenda was offered to the late R&B sensation Aaliyah who declined the role out of respect to singer Brandy Norwood as it was portrayed on her role in the movie I Still Know What You Did Last Summer (1998).",

    "Shannon Elizabeth said the director wanted to achieve a push-up look with her boobs so they kept making her wear tighter tops and bras that pushed them out as far as possible. But when the director wanted to add padding, she just turned around and said, \"Hey, do I look like the kind of girl who needs extra padding?\" Everybody on the set just burst out laughing. So finally it's just her own healthy breasts that you see in the movie.",

    "Casting directors Mary Vernieu and Anne McCarthy left the film after both a lengthy casting period and over differences with the director. A third casting director, Christine Sheaks, was brought aboard. Sheaks had little to do, since most of the film was cast by Vernieu and McCarthy.",

    "Shawn Wayans, Marlon Wayans and Lochlyn Munro later appeared together in White Chicks (2004).",

    "Lil' Kim was considered for the role of Brenda Meeks.",

    "(at around 24 minutes) The killer makes a brief appearance wearing the actual ghostface costume from Scream (1996). However, the weapon he is holding is not a knife but rather a large fishhook aka the same weapon used by the killer in I Know What You Did Last Summer (1997). Both movies are parodied in this film.",

    "(at around 11 mins) The KOMG radio station's phone number is 555-FACE (555-3223).",

    "Ray, played by Shawn Wayans, was Brenda's boyfriend. Yet, Brenda's brother was Shorty, who was played by Marlon Wayans, Shawn Wayans' brother in real life.",

    "In the principals office there is a sign that says \" Shotz\" beer, that was the beer company in Laverne and Shirley who David Lander played squiggy.",

    "Peter Bryant and Lochlyn Munro both appear together in Riverdale (2017).",

    "Greg's car is a, 1997 BMW 540i [E39].",

    "[Christopher Masterson] who played Buddy at [Scary Movie 2 (2001)] make a cameo in Scary Movie, he can be seen in the scene where Cindy receives the anonymous note in class.",

    "Three of The Brady Bunch (1969) kids first names appear in this movie: Greg, who is Buffy's boyfriend, and the two youngest children Bobby and Cindy.",

    "Two of the characters have names of people who are married in real life and have a TV show title and last name who appeared in a horror flick this spoof movie is based on. Buffy is the name of Cindy's friend, and the last name of Cindy's boyfriend in the movie is Prinze; by coincidence these two names belong to Freddie Prinze Jr. and Sarah Michelle Gellar who starred in I Know What You Did Last Summer (1997) (the movie which this spoof was made of) and of course Buffy the Vampire Slayer (1997) that came out three years earlier."
]