[
    "To prepare for the scene where Neo wakes up in a pod, Keanu Reeves lost fifteen pounds and shaved his whole body to give Neo an emaciated look.",
    "The opening action scene took six months of training and four days to shoot.",
    "After the lobby shoot-out, the camera pans back, showing the aftermath of the gunfight. A moment passes, and a large chunk of one of the pillars falls off. This was not planned, but was left in for effect.",
    "All scenes that take place within the Matrix have a green tint, as if watching them through a computer monitor. Scenes in the real world have a blue tint. Blue was also used at a minimum within the Matrix, since the directors thought blue was more of a real-world color (despite, ironically, blue being often the least-occurring color in nature). The fight scene between Morpheus and Neo, which is neither in the real world, nor in the Matrix, is tinted yellow.",
    "Carrie-Anne Moss twisted her ankle while shooting one of her scenes, but decided not to tell anyone until after filming, so they wouldn't re-cast her.",
    "According to costume designer Kym Barrett, Trinity's costume was made with cheap PVC because of the much tighter budget. Similarly, Neo's coat wasn't actually a very expensive fabric. It was a wool blend purchased for $3 a yard.",
    "At the directors' request, the actors and were to be able to understand and explain The Matrix, not only as a film, but a philosophy. Simulacra and Simulation was required reading for most of the principal cast and crew. Keanu Reeves stated the Wachowskis had him read Simulacra and Simulation, Out of Control, and Evolutionary Psychology even before they opened the script. Eventually, he was able to explain all the philosophical nuances involved. Carrie-Anne Moss commented that she had difficulty with this process.",
    "The studio insisted on a great deal of explanatory dialogue, as they described the screenplay as \"the script that nobody understands.\"",
    "Laurence Fishburne stated that once he read the script, he did not understand why other people found it confusing. However, he had a doubt if the movie would ever be made, because it was \"so smart\".",
    "Carrie-Anne Moss performed the shots featuring Trinity at the beginning of the film, and all the wire stunts throughout, herself."
]